Repository: Schlagmt/SoftwareArchitectureMidterm
Catalog: messages4.po
Languages: de

# UIContext
source: UI::Main - Get some info for Statistical Analysis
de: German Get info for Statistical Analysis

# Application1Context
source: ClassInUILibrary::UILibraryFunction -> ClassInApplication1Library::Application1LibraryFunction - Routing and Logic
de: German Routing and Logic 1

# LicenseContext
source: ClassInApplication1Library::Application1LibraryFunction->ClassInLicensingLibrary::LicensingLibraryFunction - Do some licensing
de: German Do some licensing

# SecurityContext
source: ClassInApplication1Library::Application1LibraryFunction->ClassInSecurityLibrary::SecurityLibraryFunction - Do some security
de: German Do some security

# Application2Context
source: ClassInUILibrary::UILibraryFunction -> ClassInApplication2Library::Application2LibraryFunction1 - Routing and Logic
de: German Routing and Logic 2

# Application2Context
source: Batch::Main -> ClassInApplication2Library::Application2LibraryFunction2 - Routing and Logic
de: German Batch Routing and Logic

# Application2Context
source: UI::Main -> ClassInApplication2Library::Application2LibraryFunction3 - Get Some Info
de: German Get some info

# Application2Context
source: Batch::Main -> Application2Library_API_Function1 - Do something with data
de: German Do something with data

# Application2Context
source: Batch::Main -> Application2Library_API_Function2 - Record results
de: German Record results

# Application2Context
source: UI::Main -> Application2Library_API_Function3 - Get graphable data
de: German get graphable data

# UIContext
source: UI::Main -> ClassInUILibrary::UILibraryFunction - Create a cool UI
de: German Create a cool UI

source: This is a test
de: This is a German test

# BatchContext
source: Batch::Main - Run Statistical Analysis behind the scene
de: German Behind the scenes statistical analysis

# CoreContext
source: ClassInLicensingLibrary::LicensingLibraryFunction -> ClassInCoreLibrary::CoreLibraryFunction1 - First utility
de: German 1st Core Utility

# CoreContext
source: ClassInSecurityLibrary::SecurityLibraryFunction -> ClassInCoreLibrary::CoreLibraryFunction2 - Second utility
de: German 2nd Core Utility

# CoreContext
source: ClassInStatisticalAnalysisLibrary::StatisticalAnalysisLibraryFunction -> ClassInCoreLibrary::CoreLibraryFunction3 - Third utility
de: German 3rd Core Utility

# StatisticalAnalysisContext
source: ClassInApplication2Library::Application2LibraryFunction -> ClassInStatisticalAnalysisLibrary::StatisticalAnalysisLibraryFunction - Statistical Analysis Time!!
de: German Stats Time!!
