Repository: Schlagmt/SoftwareArchitectureMidterm
Catalog: messages.po
Languages: de

# BatchContext
source: Batch::Main - Run Statistical Analysis behind the scene
de: German - Batch::Main - Run Statistical Analysis behind the scene

# Application2Context
source: ClassInUILibrary::UILibraryFunction -> ClassInApplication2Library::Application2LibraryFunction1 - Routing and Logic
de: German - ClassInUILibrary::UILibraryFunction -> ClassInApplication2Library::Application2LibraryFunction1 - Routing and Logic

# Application2Context
source: Batch::Main -> ClassInApplication2Library::Application2LibraryFunction2 - Routing and Logic
de: German - Batch::Main -> ClassInApplication2Library::Application2LibraryFunction2 - Routing and Logic

# Application2Context
source: UI::Main -> ClassInApplication2Library::Application2LibraryFunction3 - Get Some Info
de: German - UI::Main -> ClassInApplication2Library::Application2LibraryFunction3 - Get Some Info

# Application2Context
source: ClassInApplication2Library::Application2LibraryFunction2 -> Application2Library_API_Function1 - Do something with data
de: German - ClassInApplication2Library::Application2LibraryFunction2 -> Application2Library_API_Function1 - Do something with data

# Application2Context
source: ClassInApplication2Library::Application2LibraryFunction2 -> Application2Library_API_Function2 - Record results
de: German - ClassInApplication2Library::Application2LibraryFunction2 -> Application2Library_API_Function2 - Record results

# Application2Context
source: UI::Main -> Application2Library_API_Function3 - Get graphable data
de: German - UI::Main -> Application2Library_API_Function3 - Get graphable data

# StatisticalAnalysisContext
source: ClassInApplication2Library::Application2LibraryFunction -> ClassInStatisticalAnalysisLibrary::StatisticalAnalysisLibraryFunction - Statistical Analysis Time!!
de: German - ClassInApplication2Library::Application2LibraryFunction -> ClassInStatisticalAnalysisLibrary::StatisticalAnalysisLibraryFunction - Statistical Analysis Time!!

# CoreContext
source: ClassInLicensingLibrary::LicensingLibraryFunction -> ClassInCoreLibrary::CoreLibraryFunction1 - First utility
de: German - ClassInLicensingLibrary::LicensingLibraryFunction -> ClassInCoreLibrary::CoreLibraryFunction1 - First utility

# CoreContext
source: ClassInSecurityLibrary::SecurityLibraryFunction -> ClassInCoreLibrary::CoreLibraryFunction2 - Second utility
de: German - ClassInSecurityLibrary::SecurityLibraryFunction -> ClassInCoreLibrary::CoreLibraryFunction2 - Second utility

# CoreContext
source: ClassInStatisticalAnalysisLibrary::StatisticalAnalysisLibraryFunction -> ClassInCoreLibrary::CoreLibraryFunction3 - Third utility
de: German - ClassInStatisticalAnalysisLibrary::StatisticalAnalysisLibraryFunction -> ClassInCoreLibrary::CoreLibraryFunction3 - Third utility

# CoreContext
source: Application2Library_API_Function3 -> CoreLibrary_API_Function1 - Non-class utility
de: German - Application2Library_API_Function3 -> CoreLibrary_API_Function1 - Non-class utility

# UIContext
source: UI::Main - Get some info for Statistical Analysis
de: German - UI::Main - Get some info for Statistical Analysis

# UIContext
source: UI::Main -> ClassInUILibrary::UILibraryFunction - Create a cool UI
de: German - UI::Main -> ClassInUILibrary::UILibraryFunction - Create a cool UI

# Application1Context
source: ClassInUILibrary::UILibraryFunction -> ClassInApplication1Library::Application1LibraryFunction - Routing and Logic
de: German - ClassInUILibrary::UILibraryFunction -> ClassInApplication1Library::Application1LibraryFunction - Routing and Logic

# LicenseContext
source: ClassInApplication1Library::Application1LibraryFunction->ClassInLicensingLibrary::LicensingLibraryFunction - Do some licensing
de: German - ClassInApplication1Library::Application1LibraryFunction->ClassInLicensingLibrary::LicensingLibraryFunction - Do some licensing

# SecurityContext
source: ClassInApplication1Library::Application1LibraryFunction->ClassInSecurityLibrary::SecurityLibraryFunction - Do some security
de: German - ClassInApplication1Library::Application1LibraryFunction->ClassInSecurityLibrary::SecurityLibraryFunction - Do some security
